#pragma once

// Fortnite (2.4.2) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "../SDK.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
// 0x176DC (0x182AC - 0x0BD0)
class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0BD0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6AE6BE5E4245D9BDD885E88DC11CFDE2;      // 0x0BD8(0x0070)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_90346CA949B10612E2517A98EABCA3F2;// 0x0C48(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root_3FC5D63748E5DFF6573A82BF5641E6BB;      // 0x0C90(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0835E37E4BE8CE8DD6C449A998E91383;// 0x0CD8(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C2FBA628431D909430E0B383682A0D68;      // 0x0DB8(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8B17DAC94A8C00B10BE1CCB9FAFE89F2;// 0x0E28(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_DF9058564507FBE1DAB7BAADDC8AC490;// 0x0E88(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CCBF1E684B4742313BC6CD97062B3F3D;      // 0x0EE8(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9F47DEB24F88BB6E2748CF9F93B4F77F;// 0x0F58(0x00E0)
	struct FAnimNode_HandIKRetargeting                 AnimGraphNode_HandIKRetargeting_569D26DB417B57D435C3B3A6D2DB399A;// 0x1038(0x00E8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D3ABD3964FB83F7C04AFC58E9DCB63EB;// 0x1120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0FE8D5DD47202302CB024E9EFB7801E5;// 0x11A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40D295D54453A73EC29FA4BD87CB7828;// 0x1220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4FA7BB84674264CF9484387BA9C6E94;// 0x12A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1C82D4324B989B3ABF8D13AB6F351ADD;// 0x1320(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_835A3C704ACE4D1C11F9E495627C0CCC;// 0x13A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D336F23426685E50DB199B01B9A4118;// 0x1420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_187FCE204448CB24F332FEAEBEA1C755;// 0x14A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B69F29B4F1D33D1681BF8B4C3542542;// 0x1520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1333E624BBA04AB1AFD9BA966A394CA;// 0x15A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23121F6242354AE1F7EDFD8A51D62DB1;// 0x1620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8C9AC4A48FE1AED363577BABB2D9AF6;// 0x16A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18555F114952A6BEC5195680DB2D282D;// 0x1720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B041B3043BF585201C9BF811E14B5A8;// 0x17A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F061C76D47B1D0249E886EAD9930F9C1;// 0x1820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F4F7CB4B471E715B6C40BFB3061A4D7C;// 0x18A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCD7890E43A38E5F7C7097A703C398D6;// 0x1920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA70A40C4C39502181122891C1B03C56;// 0x19A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17BD565F42C654340D8DA0A6DBF0AC3E;// 0x1A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8710578D463AC2BF4F3C07AE03589C71;// 0x1AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5888D3134AB39EF4BD6090A4D05A70CF;// 0x1B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95E036394DE666520B2AACBE0C718C03;// 0x1BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20FB49A84248DCC7608A039C5E3B723F;// 0x1C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1165D6C4A871CC96410B290F01FBD2B;// 0x1CA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D39DDE6E46E687BB5F753DA11849D690;// 0x1D20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_681E0A16460C257859E5AB895D56228D;// 0x1DA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5FA3E534495CA9B86BD99A9071F22DB9;// 0x1E20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03A99EBE40BEF26D9F77C8B679A9DA44;// 0x1EA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9DD1082C47DCB632833861A44B3C3CB9;// 0x1F20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A9A8FAB6471BE9BB2065CCAD68BFD3A1;// 0x1FA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A3C2089E4A7B8D589094EA922AAEE06E;// 0x2020(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88D6886B4EC2B04EB64C09B38AD2681F;// 0x20A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_88376B1A43DE50367A9423853E95FF43;// 0x2120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B9D981343EA9D6D2C2280B5AB2D2DAA;// 0x21A0(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F5BAF9EB4418D8F24EBAFD9F8D0D504F;// 0x2220(0x00D0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_998848DA4D7B8AE19E662D97F8E0457B;// 0x22F0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3D8BBE774B8512E6EEDAFEB06FEF38C8;// 0x23C0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AE4F5A7748382CAB043226BDE304930D;// 0x24E8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0E877E5B465A1DB21E305CAE8DEA1B1A;// 0x2610(0x0128)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_A1AEC4AF468328DF6F63E386CC13288D;// 0x2738(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB449AD04E2B1D57A7EA4D9801CDD268;// 0x2808(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B5514ECF425465266EBE3C9E440E11CB;// 0x2878(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F28A25FF44EBD7F2710C828E3262F9E0;// 0x28E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2355C65C42914B6D07496C9DABD7EFB7;// 0x2958(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D5D06DEE4E8E407A6326FFAD43F69855;// 0x29A0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B775B2AF43D9F5D6F9D5E38066A15267;// 0x2A20(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_99216CF448175FD73840BFA1E4094041;// 0x2B48(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9E2CEB064A224F93E3CE1385CA9E2692;// 0x2C18(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_51FB7D7241C7BDB384055493E75D3540;// 0x2D40(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B6096A744BE20E21F747E5B83F7517C4;// 0x2E10(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D326722642BFD36ACAA4FCA87A8D039F;// 0x2F38(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_444E7D504092C4BA74879BBDA83618CA;// 0x3008(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5A6305C6401ECB8553D357832FBBEAD4;// 0x3130(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6CC554644C405CD05622E4A3CFF68E3C;// 0x3200(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EDA33DF74B5FFD64EAAB52867024E9BB;// 0x32D0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A4DE111A49185BD7E4A09EBBD9FA6E8E;// 0x33F8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0F9883DD4F3C36AD73D119863B609307;// 0x3520(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C21A040440B2DCCBDD65DC9BEE97851B;// 0x35F0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0A2D6D8247640D9B265D7EBA9DA6E2DE;// 0x3718(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_10B00CD34272B3DBDDEB11A68F5C957A;// 0x3840(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D8A512FA407E873428516497F3DDE9FB;// 0x3910(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FE0C0C46447D5C27161363872D5E22FD;// 0x3958(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_ED9098C44311C5035EA374A14161DC0C;// 0x39C8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6BC5C02B4CD2FA8C755164B3987FE8EB;// 0x3A10(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_6EB7098F40A2B1F41AC77BB788CFCE62;// 0x3A80(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_44128B5C449C317825B21F813599C3AD;// 0x3AC8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_93B0F835423922103CC0CBADEE5F90E1;// 0x3B38(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_98963AE442F5C8617693F4A8D65A3DF2;// 0x3BA8(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_27453BAE45ACEFB6B12E809EF7879AA9;// 0x3C18(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99785F88498253732CD46DA88BC21E66;// 0x3CE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44F67EB44BF1E4AF588D2C9D46536461;// 0x3D30(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6B8ADAB246C38331F6D7A481865B5FDD;// 0x3DB0(0x00D0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9DF8CAC3469F825509BFC685652E23E9;// 0x3E80(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ECA065A24DD500639E965DAB930DB4F0;// 0x3F00(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3C3635414580C34FBE43C2AF58D279E0;// 0x3F80(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D4BBAF0049A88620C171A1BB00273D39;// 0x4060(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_71DA48BE4112AC0B65E67698ED656ACE;// 0x40D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DADA904F4B9E0720914A5DA700AF517F;// 0x4140(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F88C05FD4EAA73D5FDFD3B97392BFF30;// 0x41B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6C82A98A40EC8A2A59050D931D386218;// 0x4220(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_12927177441D3C3D7EEFBBBF42BF7373;// 0x4290(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D2164CF24023D4FD70E14FA8D1739C57;// 0x42D8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B77D20AA4ED95BE56FA5DAAADD63AC57;// 0x4400(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_104244F242F870E93561F7BCF2477C3F;// 0x4448(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_05C4AAEA440392F340F5FFBFB2B55A09;// 0x4528(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E40B64B84BAD7BABAB1EE69D713975CD;// 0x45A0(0x0128)
	unsigned char                                      UnknownData00[0x8];                                       // 0x46C8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D098B494286ABC696CC8A8B4C6F2AC6;// 0x46D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69E5B3874366988B23405FAD7D36D818;// 0x4750(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_29CE967842D680CA1DB3C58269C4B2ED;// 0x47D0(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C1B5A5874CFFB2253495AB9DD7EB9A57;// 0x48B0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC75F6464FB72C23D6A1E0A9B4EB86A4;// 0x4990(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_090F99714131B4A3DE4D739A3275504F;// 0x4A00(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA72B8064EF8A893EBFF028508C54F3E;// 0x4A70(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_99C7BA6A477B5319D28566B1970881B5;// 0x4AE0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27CE611C482551D1A5897794A7486849;// 0x4B50(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_98B130354107320ECADBE19EECB2D0D1;// 0x4BC0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_283A29724C8705697A5416B703C1FA49;// 0x4CA0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05178F81458D643A5C95678AE316C2C9;// 0x4D10(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_387FCE2847DD9104A18F358CD4DEE735;// 0x4D80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_96B3951A42B25C1D6DFDF6A180083505;// 0x4DF0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D1828864C93BD298540AA9190A948BE;// 0x4E60(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_93A032A04D51FF1136C3978E985D2EA7;// 0x4ED0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D747E13544D5A741284710AAFCDC84EA;// 0x4F18(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5583B38549A46244A7027DA303869FFE;// 0x5040(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_90DB6B59470599ED03831BBAFAD9211F;// 0x5120(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A90571E64646C14279F09D84118087C8;// 0x5248(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_B6A772CC4A207C2BC9B93E9CA4C9B694;// 0x5290(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DAEC625145977FCBE52378BF14F245BF;// 0x5370(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8C5EFB2F491B6DC8C8FBEB8C063CD89E;// 0x5498(0x00E0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_A4FB0CD3465C14DBA8C2F9AC11AF2F14;// 0x5578(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F7CC30AD4CE29BF46A74D3B8390F7DEA;// 0x55F0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_90E95D0240E153AAE89F8AA032590F1B;// 0x5718(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7D7A3F494CB0B62207FEFCB8340E6994;// 0x5760(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C24A49804258188B54668E8CAA0EC788;// 0x5888(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_85D07D314BBB5A2A13C9638DE992BCCD;// 0x5958(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EF87CB124E998B5A98528CAD6C397251;// 0x5A80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8492423D43D58040DF74B4A89C908EC3;// 0x5AC8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5614E32C47568FF7494A5A855A34ADD6;// 0x5BA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01A4A9D24E9B968E62A9398F382960BC;// 0x5BF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F9C77FC847AD08D79ABC4887F2E2D451;// 0x5C70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C83AACE040BABC1FCF0FCF85A2AB80A6;// 0x5CF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67BD2B9C41B7F9F950CD608127CA101B;// 0x5D70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4EDF9B5A42C22FC6C876A38735345C03;// 0x5DF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_67BE982F4516D73F077A049325560910;// 0x5E70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01EADBF44CA417221F36A28EF106ED60;// 0x5EF0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_313FA40A4C3712ED54459095C34CB320;// 0x5F70(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CDFBA3E1434CFC3DAC46C593531D886C;// 0x6098(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_530730EE46208E58911C78B96ABEF5BD;// 0x6168(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_335715974B4DA253286BEC92A8E157C2;// 0x6290(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B950EAB84087BF5F7897B6BE6D6896F3;// 0x62D8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9972CDAC4BCC25DB6358C3853846B36E;// 0x6400(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1B4F03824798BB091E883A88C63C225C;// 0x6528(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3B3FC1604B5DAF162C7A7B84862EA8CE;// 0x65F8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B60625714A1DD14F1C010BA9376F6E97;// 0x6640(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_27C2FA404746857B0F3B29BCF1B81B9A;// 0x6768(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B690D451473E57BCDED57B9EA3C7032F;// 0x6890(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_973545594C32A43898FB90BB50F2E8F2;// 0x69B8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_34DD7D0D402DDB513825F8A1B0AEA44D;// 0x6AE0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5B1E58E94E14AD7065CFB6A9D8B9D1F1;// 0x6C08(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A1A81C6040D40DF8E457719D1A4625DA;// 0x6D30(0x0128)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_84C69BCD42357723D678BEB84AD0DEDD;// 0x6E58(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_A20F38A14CF36CF344CC048BAE9BD534;// 0x6ED0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DA54423F4380A1EA5DA721BC0C955BF8;// 0x6FA0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_485217F24DA1CE7DD3FD909FA9BA25BE;// 0x70C8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1ACF20C842223B7492C30E995AA18A6C;// 0x7198(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4DEF957438E39FE1A6B4E9E5F3A33C6;// 0x71E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_261BCB1D425E97EE43153E9865A05179;// 0x7250(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_CDFE611147E584799E50E6A012A308CA;// 0x72C0(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F4CDD4E94389BF627C74E88C0354AD96;// 0x7338(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BFDB520A4CB6C6FD867941967DF8F274;// 0x73A8(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_BEBB7ADD444E5A761AC988AEF850065D;// 0x7418(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1282B4A54A86577B4E9602A18AB09A5F;// 0x74E8(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CCC362DE4129FAC45A8E9F835A136623;// 0x7610(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6E852B004B0837DC5F319787A437D8AD;// 0x76E0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_614C3219496F52FF690660856CD61B5A;// 0x7808(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4868C8A7434D92F436811E84E38CAA4A;// 0x7850(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_09AB34B34F9A782A9CB484ACFFFA5B2D;// 0x7930(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A96404DD4595F93776716891BF27A200;// 0x7978(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_EADCF76B4D232554DB3D5F9B71BAC602;// 0x79E8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_637D5442401F7FD915B2788C8AB07089;// 0x7A30(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1F1181E448AF72430D786EBA9BC8F5DD;// 0x7B58(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_148FC92F47404EAD21AE11A2FECFF0AA;// 0x7BA0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_90C6C18A4F88FE9424AA608E78516DD4;// 0x7C10(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1FB4F074BB4541FC781B685940BFB6D;// 0x7C58(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_91EE493C4141FC70DBD98AA5C99881E9;// 0x7CC8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_76F2D00F4EA69134CFE2629D3E8592DC;// 0x7D10(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0EFBB5D041262FB97BB376B5FE628FA3;// 0x7D60(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8E09F1524F7A218B4F1EE3B279F83072;// 0x7DA8(0x0158)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_9DFABA5A4A7F384780F66CA11B74FBD0;// 0x7F00(0x0038)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2173344E467910AE388B6281444C3F1E;// 0x7F38(0x00E0)
	unsigned char                                      UnknownData01[0x8];                                       // 0x8018(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45CDB0844A1C154B04A60596900577A6;// 0x8020(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD8EA8F34B11E4C0D4585D8D21CD4791;// 0x80A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F5AB533C4B2102203A22048CEFFCDD94;// 0x8120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_682CAB9F446087098485AB97B65065A6;// 0x81A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C616F9A461ED59C501E2BBE002C2C1B;// 0x8220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_504D7E3E477DEEE78E94ACB05F2F0E42;// 0x82A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F6D3BED04D7641E786238592A285E6FA;// 0x8320(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E739EA94A3EB6D263CF4F9D8A63BCCB;// 0x83A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61747DAD4C63F902909E4889E05CC1A7;// 0x8420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_74F669814C9BE2D4B179779FF0DEA1C2;// 0x84A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BAD1F657444483494234F0B9A5890EBF;// 0x8520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F9D13DA473BB190969A46B10EA3C83F;// 0x85A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_56AEB2CE49605B5F061E9784765259C3;// 0x8620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C468F912436B0623C90DF386696E3A71;// 0x86A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E86D230478D65DAEB8445818B7B8CFF;// 0x8720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B9061B2D45D91987D923BC810446D60F;// 0x87A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C123981043E5D6DF76E6CFB301351418;// 0x8820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1793503F4ED56AA2EC8268808AC3A8B3;// 0x88A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B970985B47A107603746EFA2C0EE72F5;// 0x8920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_556770954245EDA5505E6AA8EF753F46;// 0x89A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC2CFB334ED944264EDFED80C142F56D;// 0x8A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97E4CFD547CE169D041A3D857E452304;// 0x8AA0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3597D57041383D20A9ED2DA65FA1B76B;// 0x8B20(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_74E28FA24FAB177275BC3DB513C06596;// 0x8B90(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_059CFFA342BB002B1620FC94039220D6;// 0x8C00(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B32BEAC4E62C216A8B778BD2C837F48;// 0x8CE0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_702E173842C90F7DE7A1AD877B7ABD8C;// 0x8D50(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7194340B49BC57FBA3FD0A84BF30E69F;// 0x8D98(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_CEEE7E884EC011B9F74FBC82A262D2D6;// 0x8DE8(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FEA20B8F4088BF3CCAA1B4B32B0E791F;// 0x8EC8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91BCE0774932DC1B75866386FFFB3C8B;// 0x8FA8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_72766DBD4CDEB41E86F2BC88C5F13FD3;// 0x9018(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F11FC28C4BA68010246DFBA154772DB7;// 0x9088(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD9E011D4BE32284300BC38597922B2C;// 0x90F8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_88BA565E47001A58009F488EE09C6785;// 0x9168(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4366E38C4A6B20B0956C51B305B658FA;// 0x91B0(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7C395B2E4268E7B553877A845ECC98BE;// 0x9200(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0249E7AC486A15CCCDED5AA7E9E42DF5;// 0x92E0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2A2225D44DEF157E378A690AD4A27FC;// 0x93C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_55FE11D24D167EAB3769838ED3494C88;// 0x9430(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6F29508E4CF3732ACCC2CA8721894DF3;// 0x94A0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E8F37B5A47929EE2B08C09B9DCC67FB8;// 0x9510(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8CCBF24643CE8364B60B48B76A60E2B0;// 0x9580(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88CEF67642A57BAD0690A0A3231D9A1D;// 0x95C8(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7B410C7A4547365D83D2099B7E581020;// 0x9618(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2E2E5B934FC49212A5236CA1C36D7263;// 0x96F8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2A2D30C44A127E327786D091FCC3E680;// 0x9768(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_06311F4B48BA9AB06FB37FA88F71959E;// 0x9838(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D428E06642D440985A3446B84EB42C72;// 0x9918(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F707B6404EE7817189F0568DE09909E2;// 0x9988(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA20D39B4DB1CD65515C22BF2E8AB7F1;// 0x99F8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_49DD19ED4612A880B0D81CB3236E1E59;// 0x9A68(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_01C7B8FA438CFB33F754088C56E43782;// 0x9AD8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B1E181864DDF46A3D02B83A4901BD023;// 0x9B20(0x0050)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_EB2B908F4CA469D40252FE83B4AF06E9;// 0x9B70(0x00E0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0799820040CAE1823A0A88BEEB44EAA3;// 0x9C50(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A84664224A98F59F45DC5687B8475A38;// 0x9CC8(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E8D5D2134884DC5C77B7E6A56A22477F;// 0x9D38(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8AC92ADD4B83B31A934F0E81D4ED8BB2;// 0x9E18(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_77CA7D56494300C4F9BD0FB5857529BB;// 0x9E88(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A4CF5ED3487DFAD1EA3992ACD92F1990;// 0x9EF8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DB76758845C67B57880F83B3F4AA34EC;// 0x9F68(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0C880FAD42C9FE90620F29B0812B1E78;// 0x9FD8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CB772BE4A9A67CF7F405EAF16A32C8B;// 0xA020(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BF31ED834067DCB09EB52398D06F1E99;// 0xA090(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3B76DA84DAA22FDE52DDC97EF29C928;// 0xA100(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8A3747D043D2782FD440FFBCC2EA0F85;// 0xA1D0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7007A457416A4FF44015908D5AA39830;// 0xA218(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FCB0FC034C831397E928A1924AA08F0B;// 0xA340(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_90E4248345418A4981667697C1388B30;// 0xA468(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5A2A58D046F2444F3368ECAFC5A0FBC9;// 0xA590(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F5A6116243D08C3CFE43D3A0EC66F0DC;// 0xA660(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5B8707F049AE64E555C86FB91BCA44BE;// 0xA740(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_570BEA9E44F7058C9E960D87BA7F702E;// 0xA810(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_966A5D6D43389C4C09765CAB065F30EB;// 0xA938(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7FB14B194B1FC25D73D68EBEDADB5D7C;// 0xAA08(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E073E2FA462CB46652FE06B879403AF0;// 0xAB30(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_952AB388445540CA531661A9EA345420;// 0xAC00(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_122673C544CC5AA3F7FC83B52CD40606;// 0xAD28(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3BB6D8C54459B573F50CC1B3995ACD60;// 0xADF8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_480160114160CC7731B7E5A25CD36C4F;// 0xAF20(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_31FA993E4BA1E6398E2A7B998E3072F4;// 0xB000(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9CD275AE4A6CDC9F8CADE9BB8678AB9A;// 0xB128(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_88D27E23408F59EA5089568525BBA1B7;// 0xB250(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5B2D35834AE62DDE159132B8FDBD20FF;// 0xB320(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_819A2C2B4A360C414FF1C9AFBB0D8FB3;// 0xB368(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7120D0184152A59B08B41EB326E16C50;// 0xB448(0x0050)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BA72E5A0455FDBCDB43EB8BED5582C13;// 0xB498(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_88BCD8124A58678127FF55B84FAFA8D1;// 0xB510(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5916E57B4B64B5ADAED53F9461C33322;// 0xB558(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67717579495D7A9FA6CFC483DD706300;// 0xB638(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_998621D74CA72EE3EACA10A088A74B79;// 0xB6A8(0x0070)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8CA11A0148AD3599C8C5A68936D186B1;      // 0xB718(0x0070)
	unsigned char                                      UnknownData02[0x8];                                       // 0xB788(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6F6E10D45922101B343DCAB0148CEF4;// 0xB790(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_610F274F4E3B9C4346C6949A50567B71;// 0xB810(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5830FDCE414D5B740F9F8BB352B7A708;// 0xB890(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0C40EE914E11AF87F34BB8BCE645411A;// 0xB910(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A2BBF3A4A1B2DC539D5A991C68D6E19;// 0xB990(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D93BA2AE4F09602FD06D53A35F139899;// 0xBA10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2CAAFA58456C092A2757DF9034BFF47B;// 0xBA90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_091B00F54E8BAF3A05D93C9034FD3B0B;// 0xBB10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4F7814814B371A3DF4B359BD88AF3E70;// 0xBB90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C524B57442321CE19A28E6AE05006E04;// 0xBC10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCC890AA4710698C891A5485E1E3ABCC;// 0xBC90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_226458F946103FB2126CC3A2792E015D;// 0xBD10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4AD7A8A435C3EBB6AC3CE9DA2C8B226;// 0xBD90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8DD3B2C84A372E66CD0782938E22672D;// 0xBE10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_200BE71F42E88EFFBAE17EAF152CEA7D;// 0xBE90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8B511E5D43329E71F4917D95F739CA65;// 0xBF10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0D48426549EC7113E0EE72B3A66BC60C;// 0xBF90(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7800C2CA49D6F6B3F316AE8EC5C4AC5B;// 0xC010(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_00EE3336492E5D7A635A18B10157D815;// 0xC080(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B8A261C74B15612F558C0AAE641CD1FA;// 0xC0F8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24A3B77E44D9C971145492B2546BC520;// 0xC220(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_99E12A534FFA6E8EBAA76996DEA81F89;// 0xC348(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FB574F5947E72DD18D3FC4967CCF2952;// 0xC418(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_59B6971B47A1DE990C7EDBAEC69FA4DB;// 0xC540(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4FEE2786498B1E6DD8E898884D0F2E28;// 0xC668(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A17E4BD7416A258978DD1FB5800F01CE;// 0xC748(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3DEECC2D4DD4EB6A48E7D7A4D7423EC5;// 0xC870(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE669499467CAB05E2D063B29186F080;// 0xC8B8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7D0369A4868B78590F8C68F5E969F08;// 0xC928(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_822494194418AD53A23B1DBE715585FC;// 0xC998(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_578D122946339289878AD4A8A2B43BCB;// 0xCA08(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBCFA1BB47A142BFF48B3CAC12C0EE6A;// 0xCA78(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CDD28364B0E3116E4D7908D4EC016BF;// 0xCAE8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8082DF774C89A7C94E6CD19EE53D59AC;// 0xCB58(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7902F52454C36875AB6DAABC658BE78;// 0xCBC8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1AA3764B4FAF3E770099C9852E960413;// 0xCC38(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42884F5D45FA768E5BF7B1A785DBCA67;// 0xCCA8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_86B7D2BA41F87F5298B50B865AA088DC;// 0xCD18(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_05E7AF574385243804BD59BF2B03FEB7;// 0xCD88(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE181588417A66480D26E6BE0701BFB3;// 0xCDF8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5B087E52449318CCFFC2C89E32C063C5;// 0xCE68(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B8E8C1FB4E04C25FB47922894C5CE952;// 0xCED8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_70C9530247102A4977B21AB4B4DDADBA;// 0xCF48(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F99F0C464DE1B9A3BD1F7D8C3588FB47;// 0xD018(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_59944AB44BA8923A2A0CAB8CBE821C49;// 0xD0F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C8EFF98476494801D6D7C903DA87C13;// 0xD140(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6E0D0354468623F43218789F6C5044A6;// 0xD1B0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EFFEFB5144413BBC22DE97A76D50F2A5;// 0xD220(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7BAF6290442B1DE7D431F88F5E7A7D9C;// 0xD290(0x00E0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_D8DB2B03416C10BCABEA058C1507A490;// 0xD370(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_12DAFC624505657CEEEF91BF07E66AA5;// 0xD3E8(0x0078)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_41B5354745ADF04D5A89D1825FD74C92;// 0xD460(0x0038)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D1B85C24DD6B79021C57BA92A2D1C19;// 0xD498(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A457C85D4DC4C893508D7C9D29C85AA2;// 0xD508(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7641AB054E5F12157A2E45B994E01CB9;// 0xD578(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BA3BA89D49EAA88BA1A704929961C024;// 0xD648(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_83D9A7CF465EF1FDC5C2699F4ADB96B8;// 0xD6B8(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5EAA7C3344EEB507E22CF1B12E702B5E;// 0xD798(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_08354D0E4AC7CAF25E8DAABC7D7EBE73;// 0xD878(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2F8FDBF4CC267A9346FC19BFF7C1C4E;// 0xD958(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_943C23F748EF24F97228D3AA7CDB328C;// 0xD9C8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8650DF484DB2D5AA76AA648D37855358;// 0xDA98(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4F807FA740BEC23846144BA841F2CD0D;// 0xDB68(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3115092B40128302DAEDACBEFA28B166;// 0xDBD8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_88D65BBB4B18A1FE5F9183B783AFF625;// 0xDC48(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_606BB4B84158C1A83549BBBD6CC8DA23;// 0xDCB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56DE663948F4C7E07084E6B9733D6902;// 0xDD88(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_63B0F63A4E7141A1CE0C57A8EB77835E;// 0xDDF8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC69445044AA2BAB151723A0CB919DD5;// 0xDE68(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9260056C450C16683950238F6F112106;// 0xDED8(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_32D322B345CDD0FCBF52988CA10E290E;// 0xDFA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_948BB2344072FADC66F4988E41F4953C;// 0xDFF0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4E6F91A846BD0347B4620383B23D25DB;// 0xE060(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_718ED8EF4B9DDF4F62659C8887E03FEF;// 0xE130(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_541BB3104FD5C87063CF41B44A3F5B65;// 0xE1A0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DEEB05243A30A042B5BFDB6B13C216D;// 0xE210(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_52EA24A24387E9693715FDB06F309D4A;// 0xE280(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5B063CC04F8CD9E5EC1E6AA602E603D9;// 0xE2F0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15AD3D64405AF45B02771F951EFB0E3D;// 0xE3C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2936E66E4545E3C0CC629FA0FE48820A;// 0xE430(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1DC41EFF4BB14A144E5252A8625E2186;// 0xE4A0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14A4E32B483883B9C68325814171A1FD;// 0xE510(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4D7122C449A05522EDBE81953684CF6F;// 0xE580(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_971C5831407707FD2F61699274E87DE0;// 0xE5F0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_345A31934E9935C2AF371D96753FC0C2;// 0xE660(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5364166A4E44CCEC187F7492D50D1C69;// 0xE6D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41F30FD8456B9EFC82DA9AA9670A5C87;// 0xE740(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_599224754C31D2BA7720B1B360EDDF72;// 0xE7B0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_065E238848228EF2F85E059A12620179;// 0xE820(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4A67D774C6CB4EBDBDF6E8192CBC50A;// 0xE900(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_99A1E4B54248F04F4687D69B954A5EC3;// 0xE970(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_341B8DBB4F8C0B4B355607B8164F18E6;// 0xE9B8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5EE7C5D443C82E957E3845A2050ADCA3;// 0xEA28(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2C2374A44E6BCF455E869FB7DF6D080D;// 0xEA98(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9F90F99643D036FA875EF9BEF34FBFCD;// 0xEB08(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15F6827B446469B515D405B6290814E0;// 0xEB78(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7487039343D1FB20D29A3D90744448C6;// 0xEBE8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07F4996947F1FD6D09A0F9ABF9BB16D0;// 0xEC58(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A720FC749111212DCDC4E82149BE586;// 0xECC8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A251DFB346A714BAD01845B2650E7793;// 0xED38(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A156F324634C3B582E9CD87100F5D58;// 0xEDA8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EDCE0C9D40C4D4B20226E4AA5AE8B87C;// 0xEE18(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_28CF0E154ECFA84D79D805851CE38C57;// 0xEE88(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B3566F544A7AB53037B4A3B3B5681D12;// 0xEEF8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DACFE59A43FD63FCF55DB9B77524F560;// 0xEF68(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA8A504A4472B4469FE58B9A1B67A3C4;// 0xEFD8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_24BB55A94C5B8C1CEBF92C97A8606D46;// 0xF048(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_682E912642030BD28E001AA1EF14C725;// 0xF128(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8F9F075C4C918632AFEEBD8662D1901A;// 0xF1F8(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_30BBA76747B35A4791A1DAB2B66D8A07;// 0xF240(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_FA04DD0544E75B1EADBE65ACB75C95B1;// 0xF278(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3E22F765444994C1A890CAAAED910991;// 0xF2C0(0x00E0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_8C4B3BC145DB6F2FD7780FACF676D0CF;// 0xF3A0(0x0078)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_DD77219B432B97B3584255862E88741C;// 0xF418(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_79D30C9B4BB82811599BFDAE6F9574FB;// 0xF490(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C44FD2E84741D72277EAC8B90F118A2B;// 0xF4D8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_36A8801645C3D4DDEC3BA6847D55A02D;// 0xF520(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6DDE2EF0443E2F6833096EAB865A5B05;// 0xF568(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6C1356A4252A11C25B3D78A2609D7AB;// 0xF648(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F6CEE6BD4CCC81C772B08787423C90FE;// 0xF6B8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F51E07A74B6174B2EAE582B9C51A61F2;// 0xF798(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_8770A69043C6F02B17B30A8E567320B9;// 0xF808(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_7E8097F3472419F179598699F44C722C;// 0xF868(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_F5E4F84E4588ECBECEEADCB315713C85;// 0xF8C8(0x0060)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C0F5C8504ED4DEC7786883B85F5E4E06;// 0xF928(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_9AAF4A5444BD39BEC6CFB7829B225375;// 0xFA08(0x0060)
	unsigned char                                      UnknownData03[0x8];                                       // 0xFA68(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DCE9351E41C3F1B2C18B05ADBD7D822A;// 0xFA70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF459624432831737FCC5ABC6CC537CB;// 0xFAF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AAB1064A4012DDD1DB02638D17480F17;// 0xFB70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0098AEE84093317877969B82FE7A8F7D;// 0xFBF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7F36C4454163BC69E8401BBF7C749021;// 0xFC70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E5E68C404494A9AA6322E68A75257C8B;// 0xFCF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB0D6FFA49133177E655FFBE1007E002;// 0xFD70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B07AF5854EB241D1A5B69AA3117D0A44;// 0xFDF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E67949D454D1BEF1C3979BF8DAE4CDF;// 0xFE70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D02CFF194396DEFF34F3D8B8CA4478FC;// 0xFEF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_550CFD424F7E9E17E2D876B415EB0304;// 0xFF70(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FF5D3D545BC14EA0F9E109C43CBC147;// 0xFFF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6BB17E2D4AC30C19D4ADFBA90BA87110;// 0x10070(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31408C3646A26E17719FBF86BF92B752;// 0x100F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_068AA4FA459FAF7D6BF38AA9CB6A959B;// 0x10170(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_333099CE4BE34A4D1F7918AE95252194;// 0x101F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F509D6444539FCF09B3AB80F09641C0;// 0x10270(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C2CF6BE54AA2F5873D5CC89B6A6A902E;// 0x102F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CCE4909D469B6481C5C6328FE6F312EB;// 0x10370(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C0190EA44C201A27ECBAC99B592A0E5;// 0x103F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A012CE9449496A0726C95CAF639727AC;// 0x10470(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC37C1F94F9B9D3B4B27FEA2D912E5FC;// 0x104F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B708732A4E8A2DB09017BBB0E14ED3DD;// 0x10570(0x0080)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1C89D87B40F7A3BBC1F9A0B8F630D49E;// 0x105F0(0x00E0)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_60C823BD4EB3787519721F95BE184D04;// 0x106D0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AEEEF9E948A75EBE0A3C98BDCA669B8B;// 0x10730(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_472A3B044D671C491E340FA2BED309F5;// 0x107A0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3EA8410144EAFF80D2F4F6963743B89D;// 0x10810(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EC1720054499EB608AC4D4B0EA3377C3;// 0x10880(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8B062FBC4071B490553D988B63C026EC;// 0x108F0(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A722D88D42140CA0EFE58CABC102A213;// 0x10938(0x00E0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C4B9987545F781E613103182395867B1;// 0x10A18(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_FA5F08B146B648F065DCA180625072D4;// 0x10A60(0x0048)
	struct FFortAnimNode_SpeedWarping                  FortAnimGraphNode_SpeedWarping_17867ED445F64E71BBCCE493BE20E7EF;// 0x10AA8(0x0140)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_770AF9CA4B9C561757208DB7F72B472A;// 0x10BE8(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_FDD2909B4AA9B4C98A896E92B31C2153;// 0x10C58(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_AB6EAAC54CA8E767351CABBD82856149;// 0x10CB8(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_0687EFB84F903175D14CDC88C6640505;// 0x10D18(0x0060)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_FD6B9F34455F2319DBA16391C4599694;// 0x10D78(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E998584340097926122A0C933CE5C5D3;// 0x10DD8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A809D06460F0779469A08B3CBBC520C;// 0x10E48(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1EB47DCE4636E98E69C4C88D2E4BE48E;// 0x10EB8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A425079843096A92210B80B16DA678FE;// 0x10F28(0x0048)
